Revit 2024 API
BendingDetailCustomFieldProperties Methods
The BendingDetailCustomFieldProperties type exposes the following members.
Methods
Name | Description
AreEqualTo
 Identifies if the custom field properties are equal or not.
Dispose
Equals
Determines whether the specified Object is equal to the current Object.
 (Inherited from Object.)
GetHashCode
Serves as a hash function for a particular type.
 (Inherited from Object.)
GetType
Gets the Type of the current instance.
 (Inherited from Object.)
ToString
Returns a string that represents the current object.
 (Inherited from Object.)
See Also
BendingDetailCustomFieldProperties Class
Autodesk.Revit.DB.Structure Namespace